Autodesk.Revit.DB.PrimarySizeCriterion.None
Creates a criterion with a range of no sizes.
Returns:
The new criterion.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion.All
Creates a criterion with a range of all sizes.
Returns:
The new criterion.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion.MaximumSize
The maximum size of this criterion.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion.MinimumSize
The minimum size of this criterion.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion.#ctor(System.Double,System.Double)
Constructs a PrimarySizeCriterion with a minimum and maximum size.
Since:
2013

Autodesk.Revit.DB.PrimarySizeCriterion
This class contains a size criterion for a RoutingPreferenceRule.
Since:
2013